import re

ONES = {
    0: "பூஜ்ஜியம்",
    1: "ஒன்று",
    2: "இரண்டு",
    3: "மூன்று",
    4: "நான்கு",
    5: "ஐந்து",
    6: "ஆறு",
    7: "ஏழு",
    8: "எட்டு",
    9: "ஒன்பது",
}

HUNDREDS = {
    1: ("நூறு","நூற்று"),
    2: ("இருநூறு","இருநூற்று"),
    3: ("முன்னூறு","முன்னூற்று"),
    4: ("நானூறு","நானூற்று"),
    5: ("ஐந்நூறு","ஐந்நூற்று"),
    6: ("அறுநூறு","அறுநூற்று"),
    7: ("எழுநூறு","எழுநூற்று"),
    8: ("எண்ணூறு","எண்ணூற்று"),
    9: ("தொள்ளுநூறு","தொள்ளுநூற்று"),
}

SPECIAL = {
    10: "பத்து",
    11: "பதினொன்று",
    12: "பன்னிரண்டு",
    13: "பதிமூன்று",
    14: "பதினான்கு",
    15: "பதினைந்து",
    16: "பதினாறு",
    17: "பதினேழு",
    18: "பதினெட்டு",
    19: "பத்தொன்பது",
}

TENS = {
    20: "இருபது",
    30: "முப்பது",
    40: "நாற்பது",
    50: "ஐம்பது",
    60: "அறுபது",
    70: "எழுபது",
    80: "எண்பது",
    90: "தொண்ணூறு",
}

TENS_JOIN = {
    2: "இருபத்த",
    3: "முப்பத்த",
    4: "நாற்பத்த",
    5: "ஐம்பத்த",
    6: "அறுபத்த",
    7: "எழுபத்த",
    8: "எண்பத்த",
    9: "தொண்ணூற்ற",
}

def tamil_number(n):

    if n < 10:
        return ONES[n]

    if n < 20:
        return SPECIAL[n]

    if n < 100:

        if n % 10 == 0:
            return TENS[n]

        t = n // 10
        o = n % 10

        JOIN = {
            1: "ொன்று",
            2: "ிரண்டு",
            3: "ிமூன்று",
            4: "ினான்கு",
            5: "ைந்து",
            6: "ாறு",
            7: "ேழு",
            8: "ெட்டு",
            9: "ொன்பது",
        }

        return TENS_JOIN[t] + JOIN[o]

    if n < 1000:

        h = n // 100
        r = n % 100

        if r == 0:
            return HUNDREDS[h][0]

        return HUNDREDS[h][1] + " " + tamil_number(r)

    if n < 10000:

        th = n // 1000
        r = n % 1000

        if th == 1:
            prefix = "ஆயிரத்து"
        else:
            prefix = tamil_number(th) + " ஆயிரத்து"

        if r == 0:
            return "ஆயிரம்" if th == 1 else tamil_number(th) + " ஆயிரம்"

        return prefix + " " + tamil_number(r)

    return str(n)

def normalize_numbers(text):
    return re.sub(r"\d+", lambda m: tamil_number(int(m.group())), text)